data/WS-Addressing/ws-addressing-37.xml

<?xml version="1.0" ?><S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope"><S:Header><To xmlns="http://www.w3.org/2005/08/addressing">http://localhost:4040/jaxwsa-w3c_s12/cr</To><MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:129ad27f-8797-4c70-a5c9-f60d726cdfbd</MessageID><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/none</Address><ReferenceParameters><ck:CustomerKey xmlns:ck="http://example.org/customer">Key#123456789</ck:CustomerKey></ReferenceParameters></ReplyTo><Action xmlns="http://www.w3.org/2005/08/addressing">http://example.org/action/notify</Action></S:Header><S:Body><notify xmlns="http://example.org/notify" xmlns:ns2="http://example.org/echo">test1206</notify></S:Body></S:Envelope>